<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string></string>
	<key>Identifier</key>
	<string>com.github.sebtomasi.download.LibreOfficeLangPack</string>
	<key>Input</key>
	<dict>
		<key>LANGUAGE_CODE</key>
		<string>fr</string>
		<key>NAME</key>
		<string>LibreOffice</string>
		<key>RELEASE</key>
		<string>still</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.LibreOffice</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
			<!--<string>RenameVar</string>-->
			<key>Arguments</key>
			<dict>
				<key>input_var</key>
				<string>%pathname%</string>
				<key>rename_var</key>
				<string>pathname_app</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
			<string>com.github.sebtomasi.SharedProcessors/TextSubstituer</string>
			<key>Arguments</key>
			<dict>
				<key>input_string</key>
				<string>%url%</string>
				<key>pattern_replace</key>
                <array>
                    <dict>
                        <key>pattern</key>
                        <string>.dmg</string>
                        <key>repl</key>
                        <string>_langpack_%LANGUAGE_CODE%.dmg</string>
                    </dict>
                </array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%parsed_string%</string>
				<key>filename</key>
				<string>%NAME%_langpack_%LANGUAGE_CODE%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
