<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the latest version of SplashBuddy (App only). Then, uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.sebtomasi.jss.SplashBuddy</string>
	<key>Input</key>
	<dict>
		<key>pkg_path</key>
        <string>/Users/sebastientomasi/Library/AutoPkg/Cache/com.github.sebtomasi.pkg.SplashBuddy/SplashBuddy-1.1.pkg</string>
		<key>CATEGORY</key>
		<string></string>
		<!--<key>DESCRIPTION</key>-->
		<!--<string>SplashBuddy goal is to provide an elegant and secure onboarding process for Mac users using DEP.</string>-->
		<!--<key>GROUP_NAME</key>-->
		<!--<string>%NAME%-update-smart</string>-->
		<!--<key>GROUP_TEMPLATE</key>-->
		<!--<string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>-->
		<key>NAME</key>
		<string>SplashBuddy</string>
		<!--<key>ICON</key>-->
		<!--<string>%RECIPE_DIR%/%NAME%.png</string>-->
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicySB.xml</string>
		<key>version</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.5</string>
	<key>ParentRecipe</key>
	<string>com.github.sebtomasi.pkg.SplashBuddy</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<!--<key>groups</key>-->
				<!--<array>-->
					<!--<dict>-->
						<!--<key>name</key>-->
						<!--<string>%GROUP_NAME%</string>-->
						<!--<key>smart</key>-->
						<!--<true/>-->
						<!--<key>template_path</key>-->
						<!--<string>%GROUP_TEMPLATE%</string>-->
					<!--</dict>-->
				<!--</array>-->
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%DESCRIPTION%</string>
				<!--<key>self_service_icon</key>-->
				<!--<string>%ICON%</string>-->
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
