<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the latest version of SplashBuddy (App only)</string>
	<key>Identifier</key>
	<string>com.github.sebtomasi.download.SplashBuddy</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SplashBuddy</string>
		<key>GITHUB_REPO</key>
        <string>Shufflepuck/SplashBuddy</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>The sebtomasi-recipes repo, which includes this recipe, is deprecated and will be removed in the future (details: https://github.com/autopkg/sebtomasi-recipes/issues/26).
				
Please search for alternative recipes at autopkgweb.com. If you host a recipe repo in the AutoPkg org and want to take ownership of this recipe, please comment in the issue linked above.</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
                <key>asset_regex</key>
                <string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
