<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Bayam and creates a package</string>
        <key>Identifier</key>
        <string>com.github.sebtomasi.pkg.Bayam</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Bayam</string>
            <key>SEARCH_URL</key>
            <string>https://bayam.tv/fr/telechargements</string>
            <key>SEARCH_PATTERN</key>
            <string>(https://.*/desktop/mac/Bayam.dmg)</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
	    <string>com.github.sebtomasi.download.Bayam</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>AppPkgCreator</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
