<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of Intaglio</string>
        <key>Identifier</key>
        <string>com.github.sebtomasi.download.Intaglio</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Intaglio</string>
            <key>SEARCH_URL</key>
            <string>https://www.purgatorydesign.com/Intaglio/download.html</string>
            <key>SEARCH_PATTERN</key>
            <string>(%NAME%.dmg.zip)</string>
            <key>DL_URL</key>
            <string>https://www.purgatorydesign.com/Intaglio</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%SEARCH_URL%</string>
                    <key>re_pattern</key>
                    <string>%SEARCH_PATTERN%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DL_URL%/%match%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
