<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of Intaglio and builds a package. The license's file must be passed as an argument LICENSE</string>
        <key>Identifier</key>
        <string>com.github.sebtomasi.pkg.Intaglio</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Intaglio</string>
            <key>LICENSE</key>
            <string>/Users/sebastientomasi/Desktop/temp/Scripts/com.PurgatoryDesign.Intaglio.plist</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.3</string>
        <key>ParentRecipe</key>
        <string>com.github.sebtomasi.download.Intaglio</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>Unarchiver</string>
                <key>Arguments</key>
                <dict>
                    <key>archive_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads</string>
                    <key>purge_destination</key>
                    <false/>
                </dict>
		    </dict>
            <dict>
                <key>Processor</key>
                <string>FileFinder</string>
                <key>Arguments</key>
                <dict>
                    <key>pattern</key>
                    <string>%RECIPE_CACHE_DIR%/Downloads/%NAME%*.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>com.github.sebtomasi.SharedProcessors/DmgConverterLicense</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_path</key>
                    <string>%found_filename%</string>
                </dict>
		    </dict>
            <dict>
                <key>Processor</key>
                <string>PlistReader</string>
                <key>Arguments</key>
                <dict>
                    <key>info_path</key>
                    <string>%pathname%/%NAME%.app/Contents/Info.plist</string>
                    <key>plist_keys</key>
                    <dict>
                        <key>CFBundleShortVersionString</key>
                        <string>version</string>
                        <key>CFBundleIdentifier</key>
                        <string>bundleid</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>pkgdirs</key>
                    <dict>
                        <key>Applications</key>
                        <string>0775</string>
                        <key>Library</key>
                        <string>0775</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%LICENSE%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_DIR%/Preferences</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%RECIPE_DIR%/Preferences</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/Library/Preferences</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pathname%/%NAME%.app</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/Applications/%NAME%.app</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkg_request</key>
                    <dict>
                        <key>pkgdir</key>
                        <string>%RECIPE_CACHE_DIR%</string>
                        <key>id</key>
                        <string>%bundleid%</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                        <key>scripts</key>
                        <string></string>
                        <key>chown</key>
                        <array>
                            <dict>
                                <key>path</key>
                                <string>Applications</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>admin</string>
                            </dict>
                        </array>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                    <dict>
                        <key>path_list</key>
                        <string>%pathname%</string>
                    </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
