<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest JetPhoto Studio zip.</string>
    <key>Identifier</key>
    <string>com.github.sebtomasi.download.JetPhotoStudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>JetPhoto Studio</string>
        <key>SEARCH_URL</key>
        <string>http://www.jetphotosoft.com/web/?s=downloads</string>
        <key>SEARCH_PATTERN</key>
        <string>(JetPhoto_Studio_mac[0-9].[0-9].zip)</string>
        <key>DL_URL</key>
        <string>http://www.jetphotosoft.com/web/download/</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DL_URL%/%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads</string>
				<key>purge_destination</key>
				<false/>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
			<string>com.github.sebtomasi.SharedProcessors/TextSubstituer</string>
			<key>Arguments</key>
			<dict>
				<key>input_string</key>
				<string>%match%</string>
				<key>pattern_replace</key>
                <array>
                    <dict>
                        <key>pattern</key>
                        <string>_</string>
                        <key>repl</key>
                        <key> </key>
                    </dict>
                    <dict>
                        <key>pattern</key>
                        <string>mac</string>
                        <key>repl</key>
                        <key></key>
                    </dict>
                    <dict>
                        <key>pattern</key>
                        <string>.zip</string>
                        <key>repl</key>
                        <key>.dmg</key>
                    </dict>
                </array>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>


