<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download the latest version of Lego Mindstorms Education, then packages it</string>
        <key>Identifier</key>
        <string>com.github.sebtomasi.pkg.LegoMindstormsEducation</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>EV3 Classroom</string>
            <key>DL_URL</key>
            <string>https://le-www-live-s.legocdn.com/downloads/LME-Scratch</string>
            <key>LANGUAGE_CODE</key>
            <string>en-US</string>
            <key>SEARCH_PATTERN</key>
            <string>(LME-Scratch_Full-setup_[\d.]+_%LANGUAGE_CODE%_MacOS.dmg)</string>
            <key>SEARCH_URL</key>
            <string>https://education.lego.com/en-us/downloads/mindstorms-ev3/software</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.3</string>
        <key>ParentRecipe</key>
	    <string>com.github.sebtomasi.download.LegoMindstormsEducation</string>
        <key>Process</key>
 	<array>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/%NAME%.app</string>
				<key>source_path</key>
				<string>%pathname%/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%bundleid%</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        </array>
    </dict>
</plist>
