<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download the latest version of Lego Mindstorms Education, then packages it</string>
        <key>Identifier</key>
        <string>com.github.sebtomasi.pkg.LegoMindstormsEducation</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>EV3 Classroom</string>
            <key>DL_URL</key>
            <string>https://le-www-live-s.legocdn.com/downloads/LME-Scratch</string>
            <key>LANGUAGE_CODE</key>
            <string>en-US</string>
            <key>SEARCH_PATTERN</key>
            <string>(LME-Scratch_Full-setup_[\d.]+_%LANGUAGE_CODE%_MacOS.dmg)</string>
            <key>SEARCH_URL</key>
            <string>https://education.lego.com/en-us/downloads/mindstorms-ev3/software</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.3</string>
        <key>ParentRecipe</key>
	    <string>com.github.sebtomasi.download.LegoMindstormsEducation</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                    <key>source_path</key>
                    <string>%pathname%/*.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FileFinder</string>
                <key>Arguments</key>
                <dict>
                    <key>pattern</key>
                    <string>%RECIPE_CACHE_DIR%/*.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>com.github.sebtomasi.SharedProcessors/TextSubstituer</string>
                <key>Arguments</key>
			    <dict>
                    <key>input_string</key>
                    <string>%pathname%</string>
                    <key>pattern_replace</key>
                    <array>
                        <dict>
                            <key>pattern</key>
                            <string>%RECIPE_CACHE_DIR%/downloads/LME-EV3_Full-setup_</string>
                            <key>repl</key>
                            <string></string>
                        </dict>
                        <dict>
                            <key>pattern</key>
                            <string>_%LANGUAGE_CODE%_OSX.dmg</string>
                            <key>repl</key>
                            <string></string>
                        </dict>
                    </array>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FileMover</string>
                <key>Arguments</key>
                <dict>
                    <key>source</key>
                    <string>%found_filename%</string>
                    <key>target</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%parsed_string%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
